function s = de_disturber(x)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%                                  说明
%                       输入、输出均为二进制数组
%      用7比特移位寄存器组成，扰码生成多项式：G = z^(-7)+z^(-4)+1
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
s = zeros(1,length(x));
seed = [1,0,0,1,1,0,1];
D = seed;
for i = 1:length(x)-7
    new_num = xor(xor(D(1),D(4)),x(i));
    new_in = xor(D(1),D(4));
    s(i) = new_num;                                                        %新out
    D = [D(2:7),new_in];                                                   %移位
end
a = length(x)-6;
b = length(x);
s(a:b) = x(a:b);                                                           %最后几位直接赋值
end